export const learningFactory = () => {
  return {
    tracks: [
      {
        name: 'الصف التاسع',
        courses: [
          { name: 'الرياضيات' },
          { name: 'اللغة العربية' },
          { name: 'اللغة الإنكليزية' },
          { name: 'العلوم العامة' },
          { name: 'الاجتماعيات' },
        ],
      },
      {
        name: 'البكالوريا العلمي',
        courses: [
          { name: 'الرياضيات' },
          { name: 'الفيزياء' },
          { name: 'الكيمياء' },
          { name: 'اللغة العربية' },
          { name: 'اللغة الإنكليزية' },
        ],
      },
      {
        name: 'البكالوريا الأدبي',
        courses: [
          { name: 'اللغة العربية' },
          { name: 'التاريخ' },
          { name: 'الجغرافيا' },
          { name: 'الفلسفة' },
          { name: 'اللغة الإنكليزية' },
        ],
      },
    ],
  };
};
